src/FedexAPI/FedExWebServices/wsdl/Tracking Transaction/SendNotificationsRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v12="http://fedex.com/ws/track/v12">
   <soapenv:Header/>
   <soapenv:Body>
          <v12:SendNotificationsRequest xmlns="http://fedex.com/ws/track/v12">
          <v12:WebAuthenticationDetail>
<v12:UserCredential>
                <v12:Key>Input Your Information</v12:Key>
                <v12:Password>Input Your Information</v12:Password>
             </v12:UserCredential>
          </v12:WebAuthenticationDetail>
          <v12:ClientDetail>
             <v12:AccountNumber>Input Your Information</v12:AccountNumber>
             <v12:MeterNumber>Input Your Information</v12:MeterNumber>
             <v12:Localization>
                <v12:LanguageCode>EN</v12:LanguageCode>
             </v12:Localization>
          </v12:ClientDetail>
          <v12:TransactionDetail>
             <v12:CustomerTransactionId>SendNotificationsRequest_v12</v12:CustomerTransactionId>
             <v12:Localization>
                <v12:LanguageCode>EN</v12:LanguageCode>
             </v12:Localization>
          </v12:TransactionDetail>
          <v12:Version>
             <v12:ServiceId>trck</v12:ServiceId>
             <v12:Major>12</v12:Major>
             <v12:Intermediate>0</v12:Intermediate>
             <v12:Minor>0 </v12:Minor>
          </v12:Version>
          <v12:TrackingNumber>Input Your Information</v12:TrackingNumber>
          <v12:TrackingNumberUniqueId>Input Your Information</v12:TrackingNumberUniqueId>
          <v12:ShipDateRangeBegin>2010-03-02</v12:ShipDateRangeBegin>
          <v12:ShipDateRangeEnd>2012-04-12</v12:ShipDateRangeEnd>
          <v12:SenderEMailAddress>Input Your Information</v12:SenderEMailAddress>
          <v12:SenderContactName>Input Your Information</v12:SenderContactName>
          <v12:NotificationDetail>
             <v12:PersonalMessage>Message </v12:PersonalMessage>
             <v12:Recipients>
                <v12:EMailNotificationRecipientType>SHIPPER</v12:EMailNotificationRecipientType>
                <v12:EMailAddress>Input Your Information</v12:EMailAddress>
                <v12:NotificationEventsRequested>ON_TENDER</v12:NotificationEventsRequested>
                <v12:Format>TEXT</v12:Format>
                <v12:Localization>
                   <v12:LanguageCode>EN</v12:LanguageCode>
                </v12:Localization>
             </v12:Recipients>
          </v12:NotificationDetail>
       </v12:SendNotificationsRequest>
   </soapenv:Body>
</soapenv:Envelope>